{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Asad (Asaduzzaman Pavel)",
    "label": "Backend Software Engineer",
    "email": "contact@iampavel.com",
    "phone": "+880 175 565 5440",
    "website": "https://iampavel.dev",
    "summary": "Software Engineer with a decade of experience in building robust, performant, and scalable distributed systems. Proficient in multiple programming languages and frameworks, with a passion for creating innovative software solutions. Strong technical leadership skills with a track record of successfully leading technical projects and collaborating effectively with cross-functional teams.",
    "profiles": [
      {
        "network": "Github",
        "url": "https://github.com/k1ng440",
        "username": "k1ng440"
      },
      {
        "network": "Linkedin",
        "url": "https://www.linkedin.com/in/asaduzzamanpavel",
        "username": "asaduzzamanpavel"
      }
    ],
    "location": {}
  },
  "references": [
    {
      "name": "Zayed bin Suroor Al Nahyan, Founder and CEO of Rise Enterprises RSC Limited",
      "reference": "Asaduzzaman is a very talented and hardworking developer. He is very passionate about his work and always tries to deliver the best possible solution. He is a great team player and always ready to help others. I would highly recommend him."
    },
    {
      "name": "Azat Ahmedov, Frontend Developer at Rise Enterprises RSC Limited",
      "reference": "Asaduzzaman is a professional developer and a honest good person. We worked in the same project 3 years together. He definitely knows what he is doing. As a senior lead backend developer, he setup project's backend infrastructure and coded it using golang and microservices - initially and continued to improve it. He is not afraid of any challenges we faced and found a solutions that worked and done the job on a large scale. His code is nice, clean and professional. I would definitely recommend him as a professional developer."
    },
    {
      "name": "Glenn Pierce, Founder and CEO of Stuffinabox Solutions",
      "reference": "Asaduzzaman has been a great asset to our team. He developed a complex CRM and IMS system for us that has been running smoothly for years. He is a great communicator and always delivers on time. I would highly recommend him."
    }
  ],
  "education": [
    {
      "area": "Science",
      "studyType": "GCSE A level",
      "startDate": "2007-06-01",
      "endDate": "2009-06-30"
    }
  ],
  "work": [
    {
      "name": "Self-employed",
      "company": "Self-employed",
      "position": "Freelance Full Stack Developer",
      "location": "Bangladesh",
      "startDate": "2022-10-01",
      "isCurrentRole": true,
      "highlights": [
        "Received positive feedback from clients for my exceptional communication, responsiveness, and commitment to delivering exceptional results.",
        "Provided ongoing maintenance and support for existing clients, ensuring the smooth operation of their systems."
      ]
    },
    {
      "name": "Allrites",
      "company": "Allrites",
      "position": "Backend Software Engineer (Contract)",
      "location": "Remote",
      "startDate": "2022-07-01",
      "endDate": "2022-09-30",
      "url": "https://www.allrites.com/",
      "highlights": [
        "Optimized the response time of the website by 2500 milliseconds, significantly improving overall user experience and performance.",
        "Implemented staging auto shutdown during off-peak hours, resulting in cost savings and improved resource utilization.",
        "Added auto startup/shutdown for encoding servers based on demand, ensuring efficient resource allocation and cost-effective scaling.",
        "Built pulumi IaC (Infrastructure as Code) to streamline the deployment and management of cloud infrastructure.",
        "Added monitoring and distributed tracking, enhancing system observability and enabling proactive issue detection and resolution."
      ]
    },
    {
      "name": "Rise Enterprises RSC Limited",
      "company": "Rise Enterprises RSC Limited",
      "position": "Backend Software Engineer",
      "location": "Remote",
      "startDate": "2017-03-01",
      "endDate": "2022-09-30",
      "highlights": [
        "Saved $40,000 annually by optimizing server and storage usage, resulting in reduced operational costs.",
        "Developed highly scalable microservices capable of handling hundreds of thousands of requests, optimizing performance and resource utilization.",
        "Integrated numerous RESTful and WebSocket APIs to aggregate price based on volume, contributing to data-driven decision-making processes.",
        "Designed and implemented a highly scalable and fault-tolerant distributed system using Go, PostgreSQL, and Redis, achieving 99.99% uptime.",
        "Orchestrated Docker container clusters using Kubernetes, enabling efficient container management and scalability.",
        "Implemented a CI/CD pipeline using GitLab CI/CD, reducing deployment time by 80%."
      ]
    },
    {
      "name": "Eleven Digital, Inc.",
      "company": "Eleven Digital, Inc.",
      "position": "Full Stack Engineer",
      "location": "Remote",
      "startDate": "2016-06-01",
      "endDate": "2017-02-28",
      "highlights": [
        "Developed a hybrid ticketing platform for live events, achieving a significant user base with 100,000 views and 2,500 downloads in the first week.",
        "Designed and implemented an Ad-tech platform, contributing to innovative advertising solutions for clients.",
        "Created several prototypes for mobile and web applications, exploring new technologies and user experiences.",
        "Collaborated with cross-functional teams to develop and implement new features, ensuring a smooth transition and no downtime during system implementations."
      ]
    },
    {
      "name": "VDYO Pty Ltd",
      "company": "VDYO Pty Ltd",
      "position": "Full Stack Engineer",
      "location": "Remote",
      "startDate": "2014-07-01",
      "endDate": "2016-06-30",
      "url": "https://www.vdyo.co/",
      "highlights": [
        "Led the development of a highly scalable multi-tenant video-on-demand SaaS platform, adopted by leading media companies, including AACTA.",
        "Incorporated advanced features such as Digital Rights Management, Video Encryption, Multi-bitrate Streaming, Heat Map Analytics, and Facebook Integration.",
        "Ensured user and data security with features like Custom Branding and URLs, Digital Rights Management, and Pre-Roll Advertising."
      ]
    },
    {
      "name": "Self-employed",
      "company": "Self-employed",
      "position": "Freelance Full Stack Developer",
      "location": "Bangladesh",
      "startDate": "2013-12-01",
      "endDate": "2014-06-30",
      "highlights": [
        "Received positive feedback from clients for my exceptional communication, responsiveness, and commitment to delivering exceptional results.",
        "Collaborated with clients to determine project scope and requirements, ensuring the timely delivery of high-quality products.",
        "Provided ongoing maintenance and support for existing clients, ensuring the smooth operation of their systems."
      ]
    },
    {
      "name": "Stuffinabox Solutions",
      "company": "Stuffinabox Solutions",
      "position": "Full Stack Developer",
      "location": "Remote",
      "startDate": "2011-02-01",
      "endDate": "2013-11-30",
      "highlights": [
        "Developed a highly scalable and fault-tolerant CRM and IMS (Inventory Management System) using PHP, MySQL, and memecached, achieving 99.99% uptime.",
        "Designed and implemented a CI/CD pipeline using Jenkins, reducing deployment time by 80%.",
        "Integreated with HugesNet, a satellite internet service provider, to provide a seamless experience service providers and customers.",
        "Provided high-quality support to ensure a smooth transition and no downtime during system implementations."
      ]
    }
  ],
  "skills": [
    {
      "name": "Backend",
      "keywords": [
        "Go",
        "PHP",
        "TypeScript",
        "JavaScript",
        "Python",
        "SQL"
      ]
    },
    {
      "name": "Frontend",
      "keywords": [
        "HTML / JSX",
        "TypeScript",
        "JavaScript",
        "React",
        "Angular"
      ]
    },
    {
      "name": "Database",
      "keywords": [
        "MySQL/MariaDB",
        "PostgreSQL",
        "TimescaleDB",
        "MongoDB",
        "Redis"
      ]
    },
    {
      "name": "Version Control",
      "keywords": [
        "SVN",
        "Git"
      ]
    },
    {
      "name": "Operations",
      "keywords": [
        "Linux",
        "Kubernetes",
        "Docker",
        "AWS",
        "GCP",
        "Github/GitLab CI/CD",
        "Jenkins",
        "Ansible",
        "Terraform",
        "Pulumi",
        "Prometheus",
        "Grafana",
        "ELK Stack",
        "DataDog"
      ]
    },
    {
      "name": "Practices",
      "keywords": [
        "Serverless",
        "Microservices",
        "RESTful API",
        "WebSocket",
        "gRPC",
        "GraphQL",
        "TDD",
        "BDD",
        "Agile"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Bengali",
      "fluency": "Native"
    }
  ]
}
